Repository: misterhandycap/chancelerpalpatine
Catalog: bot/i18n/*/LC_MESSAGES/*.po
Languages: pt

source: Arnaldo's Emporium
pt: Empório do Arnaldo

source: Become a planet's senator
pt: Torne-se um senador por um planeta

source: Invalid answer. Valid answers are:
pt: Resposta inválida. Respostas válidas são:

source: Game started. Answer by reaction to the bot's questions.
pt: Jogo iniciado. Responda às perguntas do bot com reações.

source: {username} thought of {name}
pt: {username} pensou em {name}

source: There has been an error with Akinator.
pt: Houve um erro com o Akinator.

source: Results for {}
pt: Resultados para {}

source: Something went wrong when searching for your anime
pt: Houve um erro ao pesquisar pelo seu anime

source: City does not exist
pt: Cidade não existe

source: Invalid datetime. Expected format:
pt: Data e/ou hora inválida(s). Formato esperado:

source: You have not yet created your astrology chart. In order to do so, send this command to my DM 😁
pt: Você ainda não criou seu mapa astral. Para fazê-lo, envie esse comando via DM 😁

source: There has been a momentary failure. Please try again in a few moments. If this error persists, then this might be a bug 😬
pt: Houve uma falha momentânea. Por favor, tente novamente em alguns momentos. Se o erro persistir, então isso pode ser um bug 😬

source: Your astrology chart
pt: Seu mapa astral

source: Your astrology triad
pt: Sua tríade

source: Solar sign
pt: Signo solar

source: Ascending sign
pt: Signo ascendente

source: Moon sign
pt: Signo da lua

source: Game already in progress
pt: Partida em andamento

source: Game started! {}, play your move
pt: Partida iniciada! {}, faça sua jogada

source: You are either not playing a game or it is not your turn anymore
pt: Você ou não está jogando nenhuma partida ou não é mais sua vez

source: You are currently playing {} games. Please provide your opponent to whom you whish to play this move.
pt: Você está jogando {} partidas. Por favor, informe seu oponente contra o qual você deseja fazer esse lance.

source: Game not found
pt: Partida não encontrada

source: Invalid move
pt: Movimento inválido

source: Game over!
pt: Fim de jogo!

source: That's your turn now, {}
pt: Seu turno é agora, {}

source: {} has abandoned the game!
pt: {} abandonou a partida!

source: Puzzle not found
pt: Puzzle não encontrado

source: Identify your opponent in case you are playing multiple games at once.
pt: Informe seu oponente caso esteja jogando múltiplas partidas ao mesmo tempo.

source: In order to play a game against the bot, use the command `{prefix}xadrez_bot`
pt: Para jogar contra o bot, use o commando `{prefix}xadrez_bot`

source: Kill him! Kill him now!
pt: Mate-o! Mate-o agora!

source: Good, {username}, good!
pt: Muito bom, {username}, muito bom!

source: No game is being played currently... ☹️ Start a new one with `{prefix}!xadrez_novo`
pt: Nenhuma partida está sendo disputada no momento... ☹️ Comece uma com `{prefix}!xadrez_novo`

source: Invalid move for the given sequence
pt: Movimento inválido para a sequência fornecida

source: Good job, puzzle solved 👍
pt: Muito bem, puzzle resolvido 👍

source: Wrong answer
pt: Resposta errada

source: Item not found
pt: Item não encontrado

source: Not enough credits
pt: Não pussi créditos suficientes

source: Item bought. Enjoy!
pt: Item comprado. Aproveite!

source: You already own this item
pt: Você já tem esse item

source: Planning a surprise order
pt: Planejando uma ordem surpresa

source: Master who?
pt: Mestre quem?

source: Invalid parameter.
pt: Parâmetro inválido.

source: Take a look at the command's documentation below for information about its correct usage:
pt: Veja a documentação do comando abaixo para instruções sobre seu uso correto:

source: This command requires an argument (`{command_name}`) that has not been provided.
pt: Esse comando requer um argumento (`{command_name}`) que não foi passado.

source: You do not have the required permissions to run this command:
pt: Você não tem as seguintes permissões necessárias para rodar esse comando:

source: Help
pt: Ajuda

source: Commands
pt: Comandos

source: No description available
pt: Sem descrição disponível

source: Aliases
pt: Nomes alternativos

source: None
pt: Nenhum

source: Arguments
pt: Argumentos

source: Category
pt: Categoria

source: Could not find a cat picture 😢
pt: Não foi possível encontrar uma foto de gato 😢

source: Invalid option
pt: Opção inválida

source: Who are you?
pt: Quem é você?

source: Vote
pt: Voto

source: Vote on your colleague's proposition!
pt: Vote na proposta de seu colega!

source: Democracy!
pt: Democracia!

source: I love democracy! {username} has summoned a vote! The proposition is **{question}**, and its options are: {options}
pt: Eu amo a democracia! {username} convocou uma votação! A proposta é **{question}**, e suas opções são: {options}

source: Did you ever hear the tragedy of Darth Plagueis, the Wise?
pt: Você já ouviu a história de Darth Plaguies, o Sábio?

source: You have received 300 palplatinas, enjoy!
pt: Você recebeu 300 palplatinas, aproveite!

source: You have alredy collected your daily today. Ambition leads to the dark side of the Force, I like it.
pt: Você já coletou sua daily hoje. A ambição leva ao lado sombrio da Força, gosto disso.

source: {username} has {currency} palplatinas.
pt: {username} tem {currency} palplatinas.

source: Browse through all available items
pt: Navegue pelos itens disponíveis

source: Your acquired items
pt: Seus itens comprados

source: Browse through all your acquired items
pt: Navegue por todos os seus itens comprados

source: Buy item
pt: Comprar item

source: Price
pt: Preço

source: Your palplatinas
pt: Suas palplatinas

source: Operation canceled
pt: Operação cancelada

source: Points
pt: Pontos

source: Chess wins
pt: Vitórias no xadrez

source: Sign
pt: Signo

source: Something went wrong when trying to fetch Star Wars Wiki's leaderboard
pt: Houve um erro ao buscar o quadro de liderança da Star Wars Wiki

source: Medal not found
pt: Medalha não encontrada

source: Star Wars Wiki's medals
pt: Medalhas da Star Wars Wiki

source: Description
pt: Descrição

source: Error parsing content
pt: Erro ao obter conteúdo

source: Invalid medals info
pt: Informações sobre medalhas inválidas

source: Language updated to {lang}
pt: Idioma atualizado para {lang}

source: cmd_busca
pt: Faz uma busca pelo buscador definido Passe o nome do buscador como primeiro argumento e sua busca na sequência. Se nenhum buscador for definido, o Google será utilizado. Buscadores disponíveis: Google, Star Wars Wiki em Português, Wookieepedia, Avatar Wiki 🇧🇷 Exemplo com buscador definido: `busca sww Sheev Palpatine` Exemplo sem buscador definido: `busca Sheev Palpatine`

source: cmd_xadrez_gif
pt: Exibe um GIF animado com uma variante fornecida para o jogo em questão, a partir do lance fornecido É necessário passar o jogo em questão, identificado com seu UUID, e o número do lance a partir do qual a sequência fornecida se inicia, que deve ser uma sequência de lances em UCI ou SAN separados por espaço. Exemplo de uso: `xgif f63e5e4f-dd94-4439-a283-33a1c1a065a0 11 Nxf5 Qxf5 Qxf5 gxf5`

source: cmd_profile
pt: Exibe o seu perfil ou de um usuário informado

source: cmd_daily
pt: Receba sua recompensa diária em Palplatinas 🤑

source: cmd_xadrez_puzzle
pt: Pratique um puzzle de xadrez Envie o comando sem argumentos para um novo puzzle. Para tentar uma jogada em um puzzle, envie o ID do puzzle como primeiro argumento e a jogada como segundo. Exemplo de novo puzzle: `xadrez_puzzle` Exemplo de jogada em puzzle existente: `xadrez_puzzle 557b7aa7e13823b82b9bc1e9 Qa2`

source: cmd_voto
pt: Cria uma votação para as demais pessoas participarem A pergunta e as opções devem ser separadas por `;`. Você pode criar votações com até dez opções. Exemplo: `voto Quem é o melhor lorde Sith?;Darth Sidious;Darth Vader;Darth Tyranus`

source: cmd_help
pt: Exibe essa mensagem Passe um comando para obter mais informações sobre ele. Parâmetros de comandos entre sinais de maior e menor (`<parametro>`) sinalizam parâmetros obrigatórios. Já parâmetros entre colchetes (`[parametro]`) sinalizam parâmetros opcionais. Valores padrões são sinalizados com um sinal de igual (`[parametro=valor_padrao]`).

source: cmd_banco
pt: Veja seu saldo de Palplatinas 💰

source: cmd_loja
pt: Veja os itens disponíveis para serem adquiridos

source: cmd_saimaluco
pt: Manda o meme sai maluco com o texto enviado

source: cmd_itens
pt: Veja os itens que você comprou

source: cmd_akinator_novo
pt: Novo jogo com Akinator Responda às perguntas do Akinator através de reações. Legenda: ✅: Sim 🇵: Provavelmente sim 🤷: Não sei / talvez 🇺: Provavelmente não 🚫: Não

source: cmd_level
pt: Mostra o nível de usuário Passe um usuário para ver seu nível. Se não for passado nenhum usuário, o seu nível de usuário será retornado.

source: cmd_aurebesh
pt: Gera uma imagem com o texto fornecido em Aurebesh

source: cmd_comprar
pt: Compre um item para seu perfil Informe o nome do item que deseja comprar. Para que possa fazê-lo, é necessário que tenha palplatinas suficientes.

source: cmd_rank
pt: Mostra a tabela de niveis de usuários em ordem de maior pra menor

source: cmd_ping
pt: Confere se o bot está online e sua velocidade de resposta

source: cmd_clear
pt: Limpa as últimas mensagens do canal atual

source: cmd_anime_busca
pt: Faça uma pesquisa por um nome de anime

source: cmd_xadrez_novo
pt: Inicie uma nova partida de xadrez com alguém Passe o usuário contra o qual deseja jogar para começar uma partida. Se quiser personalizar as cores do tabuleiro, passe o nome da cor que deseja usar (opções válidas: `blue`, `purple`, `green`, `red`, `gray` e `wood`).

source: cmd_planetas
pt: Lista todos os planetas disponíveis da região fornecida

source: cmd_vision
pt: Faça uma pergunta ao Chanceler e ele irá lhe responder

source: cmd_anime
pt: Veja informações do anime buscado com MyAnimeList

source: cmd_xadrez_bot
pt: Inicie uma nova partida de xadrez contra o bot Passe o nível de dificuldade que desejar (de 0 a 20). Se quiser personalizar as cores do tabuleiro, passe o nome da cor que deseja usar (opções válidas: `blue`, `purple`, `green`, `red`, `gray` e `wood`).

source: cmd_sorte
pt: Cara ou coroa

source: cmd_xadrez_jogar
pt: Faça uma jogada em sua partida atual Use anotação SAN ou UCI. Movimentos inválidos ou ambíguos são rejeitados. Informe o seu oponente caso esteja disputando múltiplas partidas ao mesmo tempo.

source: cmd_gato
pt: Mostra uma foto aleatória de gato 🐈

source: cmd_mapa_astral
pt: Visualize ou crie via DM seu mapa astral Para criar seu mapa astral, envie esse comando em DM para o bot informando a data, hora e local de seu nascimento da seguinte forma: `YYYY/mm/dd HH:MM Nome da cidade`. Se já tiver criado seu mapa astral, envie esse comando sem argumentos para visualizá-lo em qualquer canal. Exemplo de uso para criação de mapa astral: `mapa_astral 2000/15/01 12:00 Brasília` Exemplo de uso para visualização de mapa criado: `mapa_astral`

source: cmd_xadrez_abandonar
pt: Abandone a partida atual Informe o seu oponente caso esteja disputando múltiplas partidas ao mesmo tempo.

source: cmd_leaderboard
pt: Exibe o leaderboard de medalhas da Star Wars Wiki

source: cmd_lang
pt: Muda o idioma do bot no servidor atual Passe um código válido de idioma. Consulte os códigos válidos nesse link: https://www.gnu.org/software/gettext/manual/html_node/Usual-Language-Codes.html

source: cmd_xadrez_pgn
pt: Gera o PGN da partida atual Informe o seu oponente caso esteja disputando múltiplas partidas ao mesmo tempo.

source: cmd_medal
pt: Exibe detalhes de uma medalha da Star Wars Wiki

source: cmd_rps
pt: Pedra, papel e tesoura com dinossauros Jogadas válidas: `Deus`, `Homem`, `Dinossauro`. Regras: Homem ganha de Deus, Dinossauro ganha de Homem, Deus ganha de Dinossauro e Mulher herda a Terra em caso de empate.

source: cmd_xadrez_posicao
pt: Mostra a posição atual da partida em andamento Informe o seu oponente caso esteja disputando múltiplas partidas ao mesmo tempo.

source: cmd_medals
pt: Exibe as medalhas disponíveis da Star Wars Wiki

source: cmd_plagueis
pt: Conta a tregédia de Darth Plagueis

source: cmd_xadrez_todos
pt: Veja todas as partidas que estão sendo jogadas agora
